In [40]:
import pandas as pd

In [41]:
df = pd.read_csv('insurance.csv')
df.head()

   age     sex   bmi  children smoker     region  expenses
0   19  female  27.9         0    yes  southwest  16884.92
1   18    male  33.8         1     no  southeast   1725.55
2   28    male  33.0         3     no  southeast   4449.46
3   33    male  22.7         0     no  northwest  21984.47
4   32    male  28.9         0     no  northwest   3866.86

In [42]:
data = df.to_dict(orient='records')

In [43]:
data[:5]

[{'age': 19,
  'sex': 'female',
  'bmi': 27.9,
  'children': 0,
  'smoker': 'yes',
  'region': 'southwest',
  'expenses': 16884.92},
 {'age': 18,
  'sex': 'male',
  'bmi': 33.8,
  'children': 1,
  'smoker': 'no',
  'region': 'southeast',
  'expenses': 1725.55},
 {'age': 28,
  'sex': 'male',
  'bmi': 33.0,
  'children': 3,
  'smoker': 'no',
  'region': 'southeast',
  'expenses': 4449.46},
 {'age': 33,
  'sex': 'male',
  'bmi': 22.7,
  'children': 0,
  'smoker': 'no',
  'region': 'northwest',
  'expenses': 21984.47},
 {'age': 32,
  'sex': 'male',
  'bmi': 28.9,
  'children': 0,
  'smoker': 'no',
  'region': 'northwest',
  'expenses': 3866.86}]

In [57]:
import urllib
import urllib.parse
mango_password = urllib.parse.quote("Mongodb@1")
DB_NAME = "ins_pred"
COLLECTION_NAME = "ins_data"
CONNECTION_URL = "<connection_url>"

In [58]:
import pymongo

In [59]:
# import pymongo

client = pymongo.MongoClient(CONNECTION_URL)
data_base = client[DB_NAME]
collection = data_base[COLLECTION_NAME]
# rec = collection.insert_many(data)

In [60]:
# Browse data
collection = data_base[COLLECTION_NAME]
records = collection.find()
records

In [14]:
# for key, value in enumerate(records): # want to get the current record number hence enumerate
#     print(f"Key: {key}, value:{value}")

In [61]:
df = pd.DataFrame(list(collection.find())) # Read from Mongo DB to dataframe

In [62]:
df.head()

,_id,age,sex,bmi,children,smoker,region,expenses
0,6666c132e9212c7d5aaa7e58,19,female,27.9,0,yes,southwest,16884.92
1,6666c132e9212c7d5aaa7e59,18,male,33.8,1,no,southeast,1725.55
2,6666c132e9212c7d5aaa7e5a,28,male,33.0,3,no,southeast,4449.46
3,6666c132e9212c7d5aaa7e5b,33,male,22.7,0,no,northwest,21984.47
4,6666c132e9212c7d5aaa7e5c,32,male,28.9,0,no,northwest,3866.86

In [33]:
df.columns

Index(['_id', 'age', 'sex', 'bmi', 'children', 'smoker', 'region', 'expenses'], dtype='object')

In [34]:
df.shape

(1338, 8)

In [34]:
df.drop("_id", inplace=True, axis=1)

In [35]:
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [ ]:
# Command to set env variable - from Git bach
# export MONGODB_URL = "<mongo_DB_URL>"